id: '1073.5819'
title: Common Active Directory Commands
description: 'Detects the possible execution of specific AD commands on hosts. Threat
  Actor Association: APT29/Nobelium/Cozy Bear, APT41, FIN6, FIN10, Carbanak, CL-STA-0043,
  Lapsus$, Lazarus, MuddyWater, Sandworm Team, TA428, Turla, UNC2596, Vice Society,
  Volt Typhoon (Bronze Silhouette, Vanguard Panda), Witchetty, Wizard Spider Software
  Association: Akira, ALPHV/BlackCat, AvosLocker, Bazarloader, BianLian, Black Basta,
  Clop, Conti, Cuba, Havex, IcedID, Insekt, Lockbit, Revil, Ryuk, Snatch, WASTEDLOCKER
  Tags: TrendingThreat, Russia, Ukraine'
logic_format: Azure_Sentinel
logic: let timeframe = 2h;let ProcessCreationEvents=() { let processEvents=SecurityEvent
  | where EventID==4688 | project TimeGenerated, ComputerName=Computer, AccountName=SubjectUserName,
  AccountDomain=SubjectDomainName, FileName=tostring(split(NewProcessName, '\\')[-1]),
  ProcessCommandLine=CommandLine, InitiatingProcessFileName=ParentProcessName,InitiatingProcessCommandLine="",InitiatingProcessParentFileName="";
  processEvents};ProcessCreationEvents| where TimeGenerated >= ago(timeframe)| where
  ProcessCommandLine matches regex "(csvde|dsacls|dcpromo|dcdiag|dsmain|dsmgmt|ldifde|ldp|netdom|nltest|setspn)\\.exe"
  or (ProcessCommandLine contains "net" and ProcessCommandLine matches regex "(/domain|computer)")
  or (ProcessCommandLine contains "whoami" and ProcessCommandLine contains "/groups")|
  summarize by timestamp=bin(TimeGenerated, 1s), ComputerName, AccountName, FileName,
  InitiatingProcessFileName, InitiatingProcessCommandLine, ProcessCommandLine| project
  timestamp, ComputerName, AccountName, InitiatingProcessFileName, FileName, ProcessCommandLine|
  extend HostCustomEntity=ComputerName, AccountCustomEntity=AccountName
techniques:
- discovery:account discovery:domain account
- discovery:system service discovery
technique_id:
- T1087.002
data_category:
- Windows event logs
references:
- https://www.pwc.co.uk/cyber-security/pdf/cloud-hopper-annex-b-final.pdf
