id: '1025.5797'
title: Create_Add Local_Domain User
description: 'Detects the addition of a nonprivileged user that is added to a privileged
  local or domain group, or when a user is created. -- Threat Actor Association: Alloy
  Taurus/Gallium, APT29, APT35/Phosphorus/Magic Hound, CL-STA-0043, DarkSide, BlackMatter,
  FIN12, Lapsus$, Lazarus, Phosphorus/Magic Hound/APT35, UNC2596 -- Software Association:
  Akira, Avos, Bazarloader, BianLian, Blackbyte, Blackcat/ALPHV, Cactus, Conti, Cring,
  Cuba, Hafnium, Insekt, Lockbit, Qakbot/Qbot, Royal, SmokedHAM, TargetCompany, Trigona,
  Vice Society - Atomics T1078.003 Test#1 Atomics T1136.001 Test#3 Atomics T1136.001
  Test#4 Atomics T1136.001 Test#6 Atomics T1136.002 Test#1 Atomics T1136.002 Test#2
  Atomics T1136.002 Test#3'
logic_format: Azure_Sentinel
logic: let timeframe = 2h;let ProcessCreationEvents=() { let processEvents=SecurityEvent
  | where EventID==4688 | project TimeGenerated, ComputerName=Computer, AccountName=SubjectUserName,
  AccountDomain=SubjectDomainName, FileName=tostring(split(NewProcessName, '\\')[-1]),
  ProcessCommandLine=CommandLine, InitiatingProcessFileName=ParentProcessName,InitiatingProcessCommandLine="",InitiatingProcessParentFileName="";
  processEvents};ProcessCreationEvents| where TimeGenerated >= ago(timeframe) | where
  ProcessCommandLine matches regex "(net\\.exe|net1\\,exe)" and ProcessCommandLine
  has "add"| summarize by timestamp=bin(TimeGenerated, 5m), ComputerName, AccountName,
  FileName, InitiatingProcessFileName, InitiatingProcessCommandLine, ProcessCommandLine|
  project timestamp, ComputerName, AccountName, InitiatingProcessFileName, FileName,
  ProcessCommandLine| extend HostCustomEntity=ComputerName, AccountCustomEntity=AccountName
techniques:
- persistence:account manipulation
- persistence:create account:local account
- persistence:create account:domain account
technique_id:
- T1136.002
- T1136.001
data_category:
- Windows event logs
references:
- https://www.sans.org/reading-room/whitepapers/logging/paper/37367
