id: '1001.5111'
title: Encoded Powershell Command
description: 'PowerShell is a powerful interactive command-line interface and scripting
  environment included in the Windows operating system. Adversaries can use PowerShell
  to perform a number of actions, including discovery of information and execution
  of code. Encoded commands could be a way for an attacker to obfuscate malicious
  scripts they are executing on the victim machine. -- Threat Actor Association: Actinium/Gamaredon/Primitive
  Bear, APT28 (aka.Fancy Bear, Fighting Ursa, Forest Blizzard, Pawn Storm, TA422,
  STRONTIUM), APT29/Nobelium, APT35/Phosphorus/Magic Hound, BlackByte, DarkSide, BlackMatter,
  FIN7, Memento Team, MuddyWater, Turla (akaSecret Blizzard, KRYPTON, and UAC-0003),
  Vice Society, Volt Typhoon - Software Attribution: ALPHV/BlackCat, Bazarloader,
  Black Basta, Conti, Emotet, LV, MirrorBlast, Prestige, PYSA/Mespinoza, Ransom Cartel,
  TargetCompany, TrickBot, XingLocker, Yellow Cocaktoo/Jupiter Infostealer, WhisperGate
  - #TrendingThreat #Russia #Ukraine - Atomics T1027 Test #2 Atomics T1027 Test #3'
logic_format: Azure_Sentinel
logic: let timeframe = 2h;let ProcessCreationEvents=() { let processEvents=SecurityEvent
  | where EventID==4688 | project TimeGenerated, ComputerName=Computer, AccountName=SubjectUserName,
  AccountDomain=SubjectDomainName, FileName=tostring(split(NewProcessName, '\\')[-1]),
  ProcessCommandLine = CommandLine, InitiatingProcessFileName=ParentProcessName; processEvents};ProcessCreationEvents|
  where TimeGenerated >= ago(timeframe) | where FileName in ("powershell.exe", "powershell_ise.exe")|
  where ProcessCommandLine has "-e" or ProcessCommandLine has "-ec" or ProcessCommandLine
  has "-enc" or ProcessCommandLine has "-encoded" or ProcessCommandLine has "-encodedcommand"|
  extend Base64Encoding=extract("(\\w{20,1000}=?)", 1, ProcessCommandLine)| where
  isnotnull(Base64Encoding)| project TimeGenerated, ComputerName, AccountName, InitiatingProcessFileName,
  FileName, ProcessCommandLine, Base64Encoding| extend timestamp=TimeGenerated, HostCustomEntity=ComputerName,
  AccountCustomEntity=AccountName
techniques:
- defense-evasion:obfuscated files or information
- execution:command and scripting interpreter:powershell
technique_id:
- T1059.001
data_category:
- Windows event logs
references:
- https://unit42.paloaltonetworks.com/unit42-pulling-back-the-curtains-on-encodedcommand-powershell-attacks/
- https://www.microsoft.com/security/blog/2022/02/04/actinium-targets-ukrainian-organizations/?utm_campaign=Threat%20Report%20Newsletter&utm_medium=email&_hsmi=203254280&_hsenc=p2ANqtz-_lmhDqWF4dK1aEuVSrgJUOHdLMvJ7ORkr-vdksakqAPIxGFhGLMHMGAUiX4y9HTdUyzYWBQlJ
