id: '1116.5835'
title: Executable Create Script Process
description: 'A BAT file is a DOS batch file used to execute commands with the Windows
  Command Prompt (cmd.exe), this usecase will detect common scripting type like bat,
  sh, and ps1 with an executable parent. -- Threat Actor Association: APT28 (aka.Fancy
  Bear, Fighting Ursa, Forest Blizzard, Pawn Storm, TA422, STRONTIUM), APT29/Nobelium/Cozy
  Bear, APT31, APT35/Phosphorus/Magic Hound, APT41, APT43, Blind Eagle/APT-C-36, FIN8,
  Gamaredon Group/Shuckworm, GoldenJackal, Karakurt, Mustang Panda (aka. Stately Taurus//Earth
  Preta/BRONZE PRESIDENT/TA416/RedDelta), Redfly, TA413, UAC-0057 (GhostWriter), Vice
  Society, Volt Typhoon, Winter Vivern, Witchetty, Wizard Spider -- Software Association:
  ALPHV/BlackCat, AvosLocker, Bazarloader, BianLian, Black Basta, Blackbyte, Clop,
  Conti, Dharma, Emotet, Hive, LV, Prestige, PYSA/Mespinoza, Quantum, Rhysida, Royal,
  Snatch, Vice Society, TargetCompany, Trigona, XingLocker, Zloader - Atomics T1547.001
  Test#6 - #TrendingThreat #Russia #Ukraine'
logic_format: Azure_Sentinel
logic: let timeframe = 2h;let ProcessCreationEvents=() { let processEvents=SecurityEvent
  | where EventID==4688 | project TimeGenerated, ComputerName=Computer, AccountName=SubjectUserName,
  AccountDomain=SubjectDomainName, FileName=tostring(split(NewProcessName, '\\')[-1]),
  ProcessCommandLine=CommandLine, InitiatingProcessFileName=ParentProcessName,InitiatingProcessCommandLine="",InitiatingProcessParentFileName="";
  processEvents};ProcessCreationEvents| where TimeGenerated >= ago(timeframe)| where
  InitiatingProcessFileName contains ".exe" and ProcessCommandLine matches regex "(?i)\\.(bat|ps1|sh)"|
  summarize by timestamp=bin(TimeGenerated, 1s), ComputerName, AccountName, FileName,
  InitiatingProcessFileName, InitiatingProcessCommandLine, ProcessCommandLine| project
  timestamp, ComputerName, AccountName, InitiatingProcessFileName, FileName, ProcessCommandLine|
  extend HostCustomEntity=ComputerName, AccountCustomEntity=AccountName
techniques:
- execution:command and scripting interpreter
- exfiltration:automated exfiltration
- execution:command and scripting interpreter:windows command shell
- collection:automated collection
technique_id:
- T1059.003
data_category:
- Windows event logs
references:
- https://www.fireeye.com/blog/threat-research/2016/05/targeted_attacksaga.html
