id: '5443.5856'
title: Invoke-WebRequest Command
description: 'Detects when typical download commands are executed -- Threat Actor
  Association: APT28/Fancy Bear, FIN13, Flax Typhoon, Kimsuky, Memento Team, NewsPenguin,
  Prophet Spider, TA2541, TA505, WinterVivern/UAC-0114, Wizard Spider -- Software
  Association: ALPHV/BlackCat, Alchimist, Bazar, Babuk, Clop, Cuba, DarkGate, LV,
  Qakbot/Qbot, TargetCompany, Trickbot, Remcos RAT, XingLocker, Yanluowang, Zloader
  -- Atomics T1041 Test#1 Atomics T1074.001 Test#1 Atomics T1572 Test#1 Atomics T1566.001
  #Test1 Atomics T1087.002 Test #4'
logic_format: Azure_Sentinel
logic: let timeframe = 2h;let ProcessCreationEvents=() { let processEvents=SecurityEvent
  | where EventID==4688 | project TimeGenerated, ComputerName=Computer, AccountName=SubjectUserName,
  AccountDomain=SubjectDomainName, FileName=tostring(split(NewProcessName, '\\')[-1]),
  ProcessCommandLine=CommandLine, InitiatingProcessFileName=ParentProcessName,InitiatingProcessCommandLine="",InitiatingProcessParentFileName="",
  ServiceName, EventID; processEvents};ProcessCreationEvents| where TimeGenerated
  >= ago(timeframe)| where ProcessCommandLine matches regex '(?i)(iwr|Invoke-WebRequest|Invoke-RestMethod|curl|wget)\\s+'|
  summarize by timestamp=bin(TimeGenerated, 1s), ComputerName, AccountName, FileName,
  InitiatingProcessFileName, InitiatingProcessCommandLine, ProcessCommandLine, EventID|
  project timestamp, ComputerName, AccountName, InitiatingProcessFileName, FileName,
  ProcessCommandLine| extend HostCustomEntity=ComputerName, AccountCustomEntity=AccountName
techniques:
- execution:command and scripting interpreter:powershell
- command-and-control:ingress tool transfer
technique_id:
- T1059.001
- T1105
data_category:
- File monitoring
- Process command-line parameters
- Windows event logs
references: null
