id: '1029.5800'
title: Wscript_Cscript Execution
description: 'Monitor the execution of wscript or cscript processes as these are commonly
  utilized by threat actors to run malicious VBScript or JScript code Threat Actor
  Association: Actinium/Gamaredon/Primitive Bear, Andariel, Antlion, APT10/menuPass,
  APT28/Fancy Bear, APT29/Nobelium/Cozy Bear, APT31, APT33, APT35, APT37/Chinotto,
  APT43, Blind Eagle/APT-C-36, Carbanak, Evilnum, FIN7, Gamaredon Group/Shuckworm,
  Kimsuky, Mustang Panda (aka. Stately Taurus//Earth Preta/BRONZE PRESIDENT/TA416/RedDelta),
  NewsPenguin, Prophet Spider, TA2541, TA428, TA551, UAC-0057 (GhostWriter), WIRTE,
  Witchetty Software Association: Agent Tesla, Astaroth, Avaddon, Black Basta, BazarLoader,
  Cring, DarkGate, MirrorBlast, NanoCore, PoetRAT, QakBot, RATDispenser, SquirrelWaffle,
  Trickbot, Remcos RAT, WhisperGate, Zloader Atomics T1105 Test #11 Atomics T1059.005
  Test #1 Atomics T1082 Test #9 Atomics T1547.001 Test #5 -- #TrendingThreat #Russia
  #Ukraine'
logic_format: Azure_Sentinel
logic: let timeframe = 2h;let ProcessCreationEvents=() { let processEvents=SecurityEvent
  | where EventID==4688 | project TimeGenerated, ComputerName=Computer, AccountName=SubjectUserName,
  AccountDomain=SubjectDomainName, FileName=tostring(split(NewProcessName, '\\')[-1]),
  ProcessCommandLine=CommandLine, InitiatingProcessFileName=ParentProcessName,InitiatingProcessCommandLine="",InitiatingProcessParentFileName="";
  processEvents};ProcessCreationEvents| where TimeGenerated >= ago(timeframe) | where
  (ProcessCommandLine contains "cscript" or ProcessCommandLine contains "wscript")
  and ProcessCommandLine matches regex "(?i)(w|c)script.{1,}?\\.\\w{2,4}"| summarize
  by timestamp=bin(TimeGenerated, 5m), ComputerName, AccountName, FileName, InitiatingProcessFileName,
  InitiatingProcessCommandLine, ProcessCommandLine| project timestamp, ComputerName,
  AccountName, InitiatingProcessFileName, FileName, ProcessCommandLine| extend HostCustomEntity=ComputerName,
  AccountCustomEntity=AccountName
techniques:
- execution:command and scripting interpreter:visual basic
- execution:command and scripting interpreter:javascript
technique_id:
- T1059.007
- T1059.005
data_category:
- Process command-line parameters
- Windows event logs
references:
- https://secure.anvilogic.com/use_cases?id=AVL_UC1029
